project05/app/views/articles/_form.html.haml

SELECT "authors".* FROM "authors"
---
    %br/
    -# = this collection select method will not save to the database.
    -# = an error is therefor thrown that the author name can't be blank.
    = collection_select :article, :author_id, Author.all, :id, :name